Revit 2027 API
DisplacementElement.GetDisplacedElementIdsFromAllChildren Method
 The element ids of elements displaced by this DisplacementElement and any DisplacementElement which declare this one as parent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetDisplacedElementIdsFromAllChildren()
Public Function GetDisplacedElementIdsFromAllChildren As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetDisplacedElementIdsFromAllChildren()
member GetDisplacedElementIdsFromAllChildren : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The element ids.
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace